BulgakovStm32/New8000/In Work/NEW8000_FP/STM32F103_NEW8000FPV2_SWv004/My/Boards/FP_FacePanel/FP_FacePanel.h

#ifndef _FP_FacePanel_H
#define _FP_FacePanel_H
//***************************************************************************************************

#include "stm32f10x.h"

//***************************************************************************************************
//***************************************************************************************************
//Структура с рабочими переменными для работы в режимен НАСТРОЙКА.
#pragma pack(push, 1)//размер выравнивания в 1 байт
typedef struct{
	//--------------------
	uint32_t TimeUTC; //Время в формате UTC.
	uint16_t Address; //Адресс блока.        
	uint16_t Group;   //Группа блока.  
	//--------------------
}FPWorkReg_t;
#pragma pack(pop)//вернули предыдущую настройку.
//*************************************************
//Структура ответа лицевой панели на запрос от ЦП.
#pragma pack(push, 1)//размер выравнивания в 1 байт
typedef struct{
	//--------------------
	uint32_t TimeUTC;        //Время в формате UTC.
	uint8_t  MicState;			 //Состояние микрофона
	uint8_t  KeyState;			 //Положение ключа.
	uint8_t  Address;        //Адресс блока.        
	uint8_t  Group;          //Группа блока.  
	uint8_t  Control_Buttons;//Состояние кнопок управления.
	uint8_t  Alg_Buttons;    //Состояние кнопок АЛГОРИТМЫ ОПОВЕЩЕНИЯ.
	//--------------------
}FPData_t;
#pragma pack(pop)//вернули предыдущую настройку.
//*************************************************
#define FP_TYPE             			0x02 //Тип модуля - лицевая панель.
//Команды FP.
#define FP_CMD_SEND_STATUS        0x11 //Команда "Выдача статуса от FP".
#define FP_CMD_SET_ADDRES			    0x12 //Команда установки адрес блока
#define FP_CMD_SET_GROUP		      0x13 //Команда установки группы блока 
#define FP_CMD_SET_TIME			      0x14 //Команда установки времени
#define FP_CMD_SET_DATA		        0x15 //Команда установки даты
#define FP_CMD_TEST_ZUMMER		    0x16 //Команда влючение тестирования зуммера ЦП
#define FP_CMD_LC_SAVE_REF        0x17 //Команда сохранения опорных значений для Lc.
#define FP_CMD_GET_LOG		        0x18 //Команда получения одного события из журнала событий
#define FP_CMD_GET_INPUT_CONFIG		0x19 //Команда получени параметров одного входа пожарного шлейфа.
#define FP_CMD_SET_INPUT_CONFIG	  0x20 //Команда сохранения параметров одного входа пожарного шлейфа.
#define FP_CMD_SET_POWER_CHECK	  0x21 //Команда сохранения контроля питания блока.

//***************************************************************************************************
//***************************************************************************************************
FPWorkReg_t* FacePanel_WorkReg(void);

//***************************************************************************************************
//***************************************************************************************************
#endif /*_FP_FacePanel_H*/



